Repository: mozilla-mobile/firefox-ios
Catalog: firefox-ios/Shared/Supporting Files/TabLocation.xcstrings
Source language: en_us
Languages: ab, be, br, bs, ca, co, cs, cy, da, de, dsb, el, eo, es, es_ar, es_cl, es_mx, eu, fi, fr, gd, gl, he, hr, hsb, hu, hy_am, ia, id, is, it, ja, ka, kab, kk, ko, lo, ml, nb, nl, nn, pa_in, pl, pt_br, pt_pt, rm, ru, sat_olck, scn, si, sk, sl, sq, su, sv, tg, th, tr, tt, ug, uk, vi, zh_cn, zh_tw

# TopSites.RemoveButton.LargeContentTitle.v122
source: Remove page
ab: Ианыхтәуп адаҟьа
be: Выдаліць старонку
br: Dilemel ar bajenn
bs: Ukloni stranicu
ca: Elimina la pàgina
co: Caccià a pagina
cs: Odebrat stránku
cy: Dileu tudalen
da: Fjern side
de: Seite entfernen
dsb: Bok wótwónoźeś
el: Αφαίρεση σελίδας
eo: Forigi paĝon
es: Eliminar página
es_ar: Eliminar página
es_cl: Borrar página
es_mx: Eliminar página
eu: Kendu orria
fi: Poista sivu
fr: Retirer la page
gd: Thoir an duilleag air falbh
gl: Retirar páxina
he: הסרת דף
hr: Ukloni stranicu
hsb: Stronu wotstronić
hu: Oldal eltávolítása
hy_am: Հեռացնել էջը
ia: Remover le pagina
id: Hapus laman
is: Fjarlægja síðu
it: Rimuovi pagina
ja: ページを削除
ka: გვერდის მოცილება
kab: Kkes asebter
kk: Парақты өшіру
ko: 페이지 삭제
lo: ລືບຫນ້ານີ້
ml: താൾ മായ്ക്കുക
nb: Fjern siden
nl: Pagina verwijderen
nn: Fjern sida
pa_in: ਸਫ਼ੇ ਨੂੰ ਹਟਾਓ
pl: Usuń stronę
pt_br: Remover página
pt_pt: Remover página
rm: Allontanar la pagina
ru: Удалить страницу
sat_olck: ᱥᱟᱦᱴᱟ ᱚᱪᱚᱜᱽ ᱢᱮ
scn: Leva a pàggina
si: පිටුව ඉවත් කරන්න
sk: Odstrániť stránku
sl: Odstrani stran
sq: Hiqe faqen
su: Pupus kaca
sv: Ta bort sida
tg: Тоза кардани саҳифа
th: เอาหน้าออก
tr: Sayfayı kaldır
tt: Битне бетерү
ug: بەتنى چىقىرىۋەت
uk: Вилучити сторінку
vi: Xóa trang
zh_cn: 移除页面
zh_tw: 移除頁面
